IDENTIFICATION DIVISION.
PROGRAM-ID. Echo.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-Message PIC X(100).

PROCEDURE DIVISION USING BY REFERENCE WS-Message.
    ACCEPT WS-Message FROM CONSOLE
    DISPLAY WS-Message
    STOP RUN.
