IDENTIFICATION DIVISION.
PROGRAM-ID. Ping.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WS-Response PIC X(100) VALUE "Pong! Le programme COBOL fonctionne correctement.".

PROCEDURE DIVISION.
    DISPLAY WS-Response
    STOP RUN.
